import streamlit as st
import pandas as pd

result1=0
result2=0
result3=0
result4=0
result5=0
result6=0
result7=0
result8=0
result9=0
result10=0
result11=0
result12=0
result13=0
result14=0
result15=0

q = []

st.title('Барои синфи 9. Саволнома оид ба муайян кардани шавқу рағбат.')

st.subheader('Аз 15 саволи зерин кадомаш ба шумо маъқул аст')

q1  = st.radio(
     "",
     ('Ҳал намудани масъалаҳои мураккаби математикӣ.', 'Тайёр кардани маҳлулҳо, омехтани реактивҳо.', 'Омўзиши хусусиятҳои ҷараёнҳои физиологӣ, дар организмҳои гуногун.', 'Ҷамъ овардани намудҳои гуногуни маъданҳо (минералҳо).',  'Сохтани (ширеш кардани) модели самолётҳо, ҳавопаймоҳо', 'Иҷро кардани кор бо истифода аз асбобҳои ченкунӣ ва санҷишӣ.', 'Мутолиа намудани асарҳои классикони адабиёти ҷаҳон.', 'Мутолиа кардани асарҳо дар бораи фаъолияти кормандони умури дохила, мубориза бо вайронкунандагони қонун.', 'Шинос шудан ба таърих ва ҳунарҳои халқии Тоҷикистон.', 'Мутолиа кардани китобҳо дар бораи кори омўзгорон.', 'Мутолиа кардани китобу, маҷаллаҳои тиббӣ ва дар бораи фаъолияти духтурон.', 'Тозаю озода нигоҳ  доштани манзил.', 'Мутолиа кардани адабиёти ҳарбӣ.', ' Шунидани мусиқии  классикӣ.', '  Мутолиа кардани китобҳо дар бораи рассомҳо.'))
if q1 == 'Ҳал кардани  масъалаҳои математикӣ ва ҳисобҳои мураккаби математикӣ.':
    result1+=1
if q1 == 'Тайёр кардани маҳлулҳо, омехтани реактивҳо.':
    result2+=1
if q1 == 'Омўзиши хусусиятҳои ҷараёнҳои физиологӣ, дар организмҳои гуногун.':
    result3+=1
if q1 == 'Ҷамъ овардани намудҳои гуногуни маъданҳо (минералҳо).':
    result4+=1
if q1 == 'Сохтани (ширеш кардани) модели самолётҳо, ҳавопаймоҳо.':
    result5+=1
if q1 == 'Иҷро кардани кор бо истифода аз асбобҳои ченкунӣ ва санҷишӣ.':
    result6+=1
if q1 == 'Мутолиа намудани асарҳои классикони адабиёти ҷаҳон.':
    result7+=1
if q1 == 'Мутолиа кардани асарҳо дар бораи фаъолияти кормандони умури дохила, мубориза бо вайронкунандагони қонун.':
    result8+=1
if q1 == 'Шинос шудан ба таърих ва ҳунарҳои халқии Тоҷикистон.':
    result9+=1
if q1 == 'Мутолиа кардани китобҳо дар бораи кори омўзгорон.':
    result10+=1
if q1 == 'Мутолиа кардани китобу, маҷаллаҳои тиббӣ ва дар бораи фаъолияти духтурон.':
    result11+=1
if q1 == 'Тозаю озода нигоҳ  доштани манзил.':
    result12+=1
if q1 == 'Мутолиа кардани адабиёти ҳарбӣ.':
    result13+=1
if q1 == 'Шунидани мусиқии  классикӣ.':
    result14+=1
if q1 == ' Мутолиа кардани китобҳо дар бораи рассомҳо.':
    result15+=1


q2 = st.radio(
     'Аз 15 саволи зерин кадомаш ба шумо маъқул аст',
     ('Дарсҳои математика.', 'Ҳал кардани масъалаҳои химиявӣ.', 'Омўзиши сохти анатомии ҳайвонот.', 'Хондан дар бораи давлатҳои гуногун, иқтисодиёт ва сохти давлатдории онҳо.',  'Хондани маҷаллаҳои техникӣ.', 'Хондани мақолаҳо ва маҷаллаҳои илмӣ-оммавӣ роҷеъ ба дастовардҳо дар соҳаи радиотехника.', 'Таҳлил кардан, муқоиса намудан ва баҳо додан ба асарҳои бадеӣ.',  'Шиносоӣ бо қонунҳо, фармонҳо, оинномаҳо, дастурамалҳои гуногун.', 'Омўхтани таърихи шаҳр, ноҳияе, ки дар он истиқомат доред.', 'Ёрӣ додан ба рафиқони дар таҳсил қафомонда, фаҳмондани масъалаҳои душворфаҳм.', 'Омўзиши дарсҳои анатомия ва физиологияи одам.',  'Ҳамеша бо одамон кор кардан ва хастагиро ҳис накардан.', 'Шиносоӣ бо техникаи ҳарбӣ.', 'Мусиқии ҳозиразамонро гўш кардан.', 'Ба музейҳо ва намоишгоҳҳои бадеӣ ташриф овардан.'))

if q2 == 'Дарсҳои математика.':
    result1+=1
if q2 == 'Ҳал кардани масъалаҳои химиявӣ.':
    result2+=1
if q2 == 'Омўзиши сохти анатомии ҳайвонот':
    result3+=1
if q2 == 'Хондан дар бораи давлатҳои гуногун, иқтисодиёт ва сохти давлатдории онҳо.':
    result4+=1
if q2 == 'Хондани маҷаллаҳои техникӣ':
    result5+=1
if q2 == 'Хондани мақолаҳо ва маҷаллаҳои илмӣ-оммавӣ роҷеъ ба дастовардҳо дар соҳаи радиотехника.':
    result6+=1
if q2 == 'Таҳлил кардан, муқоиса намудан ва баҳо додан ба асарҳои бадеӣ.':
    result7+=1
if q2 == 'Шиносоӣ бо қонунҳо, фармонҳо, оинномаҳо, дастурамалҳои гуногун.':
    result8+=1
if q2 == 'Омўхтани таърихи шаҳр, ноҳияе, ки дар он истиқомат доред.':
    result9+=1
if q2 == 'Ёрӣ додан ба рафиқони дар таҳсил қафомонда, фаҳмондани масъалаҳои душворфаҳм.':
    result10+=1
if q2 == 'Омўзиши дарсҳои анатомия ва физиологияи одам.':
    result11+=1
if q2 == 'Ҳамеша бо одамон кор кардан ва хастагиро ҳис накардан.':
    result12+=1
if q2 == 'Шиносоӣ бо техникаи ҳарбӣ.':
    result13+=1
if q2 == 'Мусиқии ҳозиразамонро гўш кардан.':
    result14+=1
if q2 == 'Ба музейҳо ва намоишгоҳҳои бадеӣ ташриф овардан.':
    result15+=1


q3 = st.radio(
     'Аз 15 саволи зерин кадомаш ба шумо маъқул аст',
     ('Дар маҳфили математикӣ иштирок кардан, дар мактаби метематики хондан', 'Дарсҳои химия.', 'Хондани китобҳо дар бораи олами наботот ва ҳайвонот.', 'Бо ҳамроҳии геологҳо ба экспедитсия рафтан.', 'Шиносоӣ бо дастовардҳои техникаи ҳозиразамон (тамошо кардан ва шунидани барномаҳои телерадио, ба намоишгоҳҳои техникӣ рафтан).', 'Дар маҳфили техникию  компютерӣ  шуғл варзидан.', 'Хондани мақолаҳои адабӣ – техникӣ.', 'Омўхтани сохти сиёсӣ ва тағйиротҳои иҷтимоии дигар давлатҳо.', 'Хондани китобҳо дар мавзўъҳои таърихӣ.', 'Таҳлил кардани рафтору кирдори худ, рафтор бо одамон ҳангоми муносибат бо одамон.', 'Шиносоӣ бо комёбиҳои соҳаи тиб.', 'Тайёр намудани озуқаворӣ ҳангоми сайёҳатҳо.', 'Дарсҳои тарбияи ҷисмонӣ.', 'Дар мактаби мусиқӣ шуғл варзидан.', 'Дар маҳфили рассомон шуғл варзидан.' ))

if q3 == 'Дар маҳфили математикӣ иштирок кардан, дар мактаби метематики хондан.':
    result1+=1
if q3 == 'Дарсҳои химия.':
    result2+=1
if q3 == 'Хондани китобҳо дар бораи олами наботот ва ҳайвонот.':
    result3+=1
if q3 == 'Бо ҳамроҳии геологҳо ба экспедитсия рафтан.':
    result4+=1
if q3 == 'Шиносоӣ бо дастовардҳои техникаи ҳозиразамон (тамошо кардан ва шунидани барномаҳои телерадио, ба намоишгоҳҳои техникӣ рафтан).':
    result5+=1
if q3 == 'Дар маҳфили техникию  компютерӣ  шуғл варзидан.':
    result6+=1
if q3 == 'Хондани мақолаҳои адабӣ – техникӣ.':
    result7+=1
if q3 == 'Омўхтани сохти сиёсӣ ва тағйиротҳои иҷтимоии дигар давлатҳо.':
    result8+=1
if q3 == 'Хондани китобҳо дар мавзўъҳои таърихӣ.':
    result9+=1
if q3 == 'Таҳлил кардани рафтору кирдори худ, рафтор бо одамон ҳангоми муносибат бо одамон.':
    result10+=1
if q3 == 'Шиносоӣ бо комёбиҳои соҳаи тиб.':
    result11+=1
if q3 == 'Тайёр намудани озуқаворӣ ҳангоми сайёҳатҳо.':
    result12+=1
if q3 == 'Дарсҳои тарбияи ҷисмонӣ.':
    result13+=1
if q3 == 'Дар мактаби мусиқӣ шуғл варзидан.':
    result14+=1
if q3 == 'Дар маҳфили рассомон шуғл варзидан.':
    result15+=1



q4 = st.radio(
    'Аз 15 саволи зерин кадомаш ба шумо маъқул аст', (
        'Ҳал кардани масъалаҳои математикӣ.',
        'Гузаронидани таҷрибаҳои химиявӣ.',
        'Дарсҳои ботаника, зоология, анатомия.',
        'Маълумот гирифтан дар бораи ҷойҳои нави кор оид ба коркарди канданиҳои фоиданок.',
        'Сарфаҳм рафтан дар нақшаҳо  ва таҳрирҳои техникӣ.',
        'Таъмир кардани асбобҳои барқии (электрикии) рўзгор.',
        'Худро дар навиштани ҳикояву шеър санҷидан.',
        'Гузаронидани ахбори сиёсӣ дар синф.',
        'Тамошои филмҳо дар бораи воқеаҳои таърихии мамлакатҳои гуногун. ',
        'Тайёр кардани маърўза, хабар ва бо онҳо дар назди хурдсолон баромад кардан.',
        'Ғамхорӣ кардан нисбат ба беморон ва ба онҳо ёрӣ расонидан.',
        'Кўмак кардан ба рафиқ дар мағоза ҳангоми интихоби либосе, ки ба ў нисбатан зебанда аст.',
        'Ширкат варзидан дар бозию саёҳатҳои ҳарбӣ.',
        'Дар саҳна шеър хондан, суруд хондан, баромад кардан.',
        'Ороиш додани рўзномаҳои деворӣ, намоишгоҳҳо.'
    )
)

if q4 == 'Ҳал кардани масъалаҳои математикӣ.':
    result1+=1
if q4 == 'Гузаронидани таҷрибаҳои химиявӣ.':
    result2+=1
if q4 == 'Дарсҳои ботаника, зоология, анатомия.':
    result3+=1
if q4 == 'Маълумот гирифтан дар бораи ҷойҳои нави кор оид ба коркарди канданиҳои фоиданок.':
    result4+=1
if q4 == 'Сарфаҳм рафтан дар нақшаҳо  ва таҳрирҳои техникӣ.':
    result5+=1
if q4 == 'Таъмир кардани асбобҳои барқии (электрикии) рўзгор.':
    result6+=1
if q4 == 'Худро дар навиштани ҳикояву шеър санҷидан.':
    result7+=1
if q4 == 'Гузаронидани ахбори сиёсӣ дар синф.':
    result8+=1
if q4 == 'Тамошои филмҳо дар бораи воқеаҳои таърихии мамлакатҳои гуногун.':
    result9+=1
if q4 == 'Тайёр кардани маърўза, хабар ва бо онҳо дар назди хурдсолон баромад кардан.':
    result10+=1
if q4 == 'Ғамхорӣ кардан нисбат ба беморон ва ба онҳо ёрӣ расонидан.':
    result11+=1
if q4 == 'Кўмак кардан ба рафиқ дар мағоза ҳангоми интихоби либосе, ки ба ў нисбатан зебанда аст.':
    result12+=1
if q4 == 'Ширкат варзидан дар бозию саёҳатҳои ҳарбӣ.':
    result13+=1
if q4 == 'Дар саҳна шеър хондан, суруд хондан, баромад кардан.':
    result14+=1
if q4 == 'Ороиш додани рўзномаҳои деворӣ, намоишгоҳҳо.':
    result15+=1



q5 = st.radio(
    'Аз 15 саволи зерин кадомаш ба шумо маъқул аст',(
        'Ҳалли масъалахои геометрӣ.',
        'Мустақилона ҳосил намудани формулаҳои реаксияҳои кимиёвӣ.',
        'Бо микроскоп омўхтани бофтаҳои зинда, мушоҳида кардани ҳаракатҳои хурдтарини зарраҳо.',
        'Дарсҳои география.',
        'Васл ва таъмир кардани механизмҳои гуногун (велосипед, мошини дарздўзӣ ва ғайра).',
        'Васл ва таъмир кардани асбобҳои   техникию  компютерӣ.',
        'Омўзиши пайдоиши калимаву ибораҳо.',
        'Баромад намудан бо маърўзаҳо, хабарҳо дар назди шумораи зиёди одамон.',
        'Шинос шудан бо маданияти қадима аз рўи кофтуковҳои археологӣ (бостоншиносӣ).',
        'Дар синфҳои поёнӣ сардастаи ахтарон  шуда кор кардан.',
        'Расонидани ёрии аввалин ба маҷрўҳон.',
        'Расонидани хизматҳои гуногуни маишӣ ба мардум.',
        'Машғулият дар бахши дастони моҳир.',
        'Навохтани асбобҳои мусиқӣ.',
        'Бо қалам, фломастер ва  рангҳо расм кашидан.'
    )
)


if q5 == 'Ҳалли масъалахои геометрӣ.':
    result1+=1
if q5 == 'Мустақилона ҳосил намудани формулаҳои реаксияҳои кимиёвӣ':
    result2+=1
if q5 == 'Бо микроскоп омўхтани бофтаҳои зинда, мушоҳида кардани ҳаракатҳои хурдтарини зарраҳо.':
    result3+=1
if q5 == 'Дарсҳои география.':
    result4+=1
if q5 == 'Васл ва таъмир кардани механизмҳои гуногун (велосипед, мошини дарздўзӣ ва ғайра).':
    result5+=1
if q5 == 'Васл ва таъмир кардани асбобҳои   техникию  компютерӣ.':
    result6+=1
if q5 == 'Омўзиши пайдоиши калимаву ибораҳо.':
    result7+=1
if q5 == 'Баромад намудан бо маърўзаҳо, хабарҳо дар назди шумораи зиёди одамон.':
    result8+=1
if q5 == 'Шинос шудан бо маданияти қадима аз рўи кофтуковҳои археологӣ (бостоншиносӣ).':
    result9+=1
if q5 == 'Дар синфҳои поёнӣ сардастаи ахтарон  шуда кор кардан.':
    result10+=1
if q5 == 'Расонидани ёрии аввалин ба маҷрўҳон.':
    result11+=1
if q5 == 'Расонидани хизматҳои гуногуни маишӣ ба мардум.':
    result12+=1
if q5 == 'Машғулият дар бахши дастони моҳир.':
    result13+=1
if q5 == 'Навохтани асбобҳои мусиқӣ.':
    result14+=1
if q5 == 'Бо қалам, фломастер ва  рангҳо расм кашидан.':
    result15+=1




q6 = st.radio(
    'Аз 15 саволи зерин кадомаш ба шумо маъқул аст',(
        'Мутолиа кардани адабиёти илмӣ дар бораи кашфиётҳои  математикӣ ва математикони машҳур.',
        'МашҒулият дар гурўҳҳои кимиёвӣ, дар олимпиадаҳои кимиёвӣ иштирок кардан.',
        'Нигоҳубин намудани растанӣ ва ҳайвонот, инкишофи онҳоро таҳти назорат гирифтан.',
        'Ба саёҳатҳои дуру дароз  ва мушкиле баромадан, ки дар онҳо мувофиқи барномаи муайяншуда самаранок кор кардан лозим мешавад.',
        'Дарсҳои (санъат ва меҳнат, касбу ҳунар) технология.',
        'Сарфаҳм рафтан ба радиосхемаҳои мураккаб.',
        'Кор бо луҒат ва сарчашмаҳои  адабӣ.',
        'Бо навигариҳои сиёсӣ ба воситаҳои ахбор, радио, рўзнома ва оинаи нилгун шинос шудан.',
        'Шиносоӣ бо қонуниятҳои тараққиётҳои таърихии инсоният.',
        'Гузаронидани вақт бо хурдсолон, ба онҳо нақл кардан, китоб хондан.',
        'Ғамхорию дилсўзӣ зоҳир кардан нисбат ба одамон.'
        'Одобу тамкин нишон додан ҳангом муносибат бо одамон.',
        'Омўхтани таърихи муҳорибаҳои калони ҳарбӣ ва тақдири лашкаркашони бузург.',
        'Тамошо кардани саҳнаҳои театрӣ ба воситаи оинаи нилгун ва театрҳои халқӣ.',
        'Шиносоӣ бо расмҳо, ҳайкалҳо ва дигар асарҳои санъат.'
    )
)


if q6 == 'Мутолиа кардани адабиёти илмӣ дар бораи кашфиётҳои  математикӣ ва математикони машҳур.':
    result1+=1
if q6 == 'МашҒулият дар гурўҳҳои кимиёвӣ, дар олимпиадаҳои кимиёвӣ иштирок кардан.':
    result2+=1
if q6 == 'Нигоҳубин намудани растанӣ ва ҳайвонот, инкишофи онҳоро таҳти назорат гирифтан.':
    result3+=1
if q6 == 'Ба саёҳатҳои дуру дароз  ва мушкиле баромадан, ки дар онҳо мувофиқи барномаи муайяншуда самаранок кор кардан лозим мешавад.':
    result4+=1
if q6 == 'Дарсҳои (санъат ва меҳнат, касбу ҳунар) технология.':
    result5+=1
if q6 == 'Сарфаҳм рафтан ба радиосхемаҳои мураккаб.':
    result6+=1
if q6 == 'Кор бо луҒат ва сарчашмаҳои  адабӣ.':
    result7+=1
if q6 == 'Бо навигариҳои сиёсӣ ба воситаҳои ахбор, радио, рўзнома ва оинаи нилгун шинос шудан.':
    result8+=1
if q6 == 'Шиносоӣ бо қонуниятҳои тараққиётҳои таърихии инсоният.':
    result9+=1
if q6 == 'Гузаронидани вақт бо хурдсолон, ба онҳо нақл кардан, китоб хондан.':
    result10+=1
if q6 == 'Ғамхорию дилсўзӣ зоҳир кардан нисбат ба одамон.':
    result11+=1
if q6 == 'Одобу тамкин нишон додан ҳангом муносибат бо одамон.':
    result12+=1
if q6 == 'Омўхтани таърихи муҳорибаҳои калони ҳарбӣ ва тақдири лашкаркашони бузург.':
    result13+=1
if q6 == 'Тамошо кардани саҳнаҳои театрӣ ба воситаи оинаи нилгун ва театрҳои халқӣ.':
    result14+=1
if q6 == 'Шиносоӣ бо расмҳо, ҳайкалҳо ва дигар асарҳои санъат.':
    result15+=1
 

                  
                            
dictionary = {
    'Математик, иқтисодчӣ-математик, иқтисодчӣ, иқтисодчӣ-муҳосиб, муҳандис-иқтисодчӣ,Техник-математик, барномасоз, математики ҳисоббарор, техник-иқтисодчӣ, техник-нақшакаш, муҳосиб, нозири қарз, молиячӣ, оператори компютерӣ, кассир-назоратчӣ, кассир-оператори почта': result1, 'Муҳандиси технологияи кимиёвӣ, Техники технологияи кимиёвӣ, дорусоз, Дастгоҳчӣ, лаборанти кимиёвӣ, оператори панели идоракунӣ': result2,  'Биолог, агроном, ҷангалпарвар-муҳандис, агроном-хокшинос, муҳандисӣ ҳайвонот, байтор, Агроном-техник, техник-ҷангалпарвар, техники гидромелиоративй, мутахассиси соҳаи чорводорй, ёрдамчии бойтор, гулпарвар, боғбон, кабудизоркунанда, ҷангалбон, чорводор': result3, 'Биолог, гидрогеолог, геофизик, географ, харитакаш, муҳандис-геодезист, обуҳавосанҷ, гидролог, уқёнусшинос, гидрограф, Техник-топограф, техник-геодезист, Топограф, рассом-топограф': result4, 'Муҳандис-технолог, механик, бинокор, муҳандиси гармдиҳӣ, муҳандиси энергетикӣ, механики киштӣ, киштибон, ҳавонавард, Техник-технолог, механики бинокорӣ, муҳандиси гармдиҳӣ, киштисоз, механики киштӣ, бофанда, дӯзанда, пойафзолдӯз, кафшергар, таъмингар, хиштчин, андовачӣ, электрик, челогар, идоракунанда маторчӣ, ронанда': result5, 'Муҳандиси барқ, электрик, радиомеханик, Техник-электромеханик, электромонтёри техникӣ, радиотехник, Электромеханик, электромонтер, челонгар-электрик': result6, 'Нависанда, рӯзноманигор, муҳаррири адабиёти оммавӣ, китобдор, ислоҳкунандаи китобу маҷаллаҳо, муҳаррири техникӣ, ҳуруфчин, мошинист-стенограф': result7, 'Ҳуқуқшинос, муфаттиш, нозӣр, ҳуқуқшиноси кафолати бошуур, Милиса': 
result8, 'Таърихчӣ, бостоншинос, муаллими таърих': result9, 'Тарбиядиҳанда, профессор, муаллими фан, Мактаби ибтидоӣ, Муаллими боғча, муаллими синфҳои ибтидоӣ, муаллими фан, устои омузишгоҳи касбй-техникй, тарбиятгар': result10, 'Духтур, дастёри духтур, ҳамшира, Санитар': result11, 'Молшинос, тарҷумон, фурӯшанда, назоратчӣ-кассир, пешхизмат, барандаи экскурсия, роҳнамо, стюардесса': result12, 'Ҳарбӣ, устоди варзиш': result13, 'Композитор, дирижер, навозанда-вокалист, режиссери опера, балет, драма, театри лӯхтак, эстрада, актёри театр ва кино, Дирижер, навозанда, режиссер': result14, 'Меъмор, рассом, ҳайкалтарош, дизайнери графикӣ, санъатшинос, рассоми санъат, дизайнери мӯд, техник-меъмор, ороишгар, рассом-барқароркунанда, техник-тарроҳ, тарҳкаш, Заргар, пармагари булӯр, дуредгари нодиракор, сикказан, суфтакунандаи рангуборкунии чинй, кандакор, барқароркунанда, бинокор, суратгир, сартарош': result15, 
}   
    
# Sort the dictionary by value in descending order and convert it into a list
sorted_dictionary = list(sorted(dictionary.items(), key=lambda item: item[1], reverse=True))

# Get the first two items (the two maximum values)
first_two = sorted_dictionary[:2]

a = first_two[0][0]
choice="Дар ҷои аввал ба Шумо мувофиқанд: "+a
b = first_two[1][0]
choice2="Дар ҷои дуюм ба Шумо мувофиқанд: "+b

    
    

if st.button('Result'):
    st.write(result)
    st.write(result2)
